In [ ]:
#ALMUZAHIM NASEEF MUHAMAD
#S24B38/006
#B30296

import necessary library for the work

In [79]:
import warnings
warnings.filterwarnings("ignore")

In [80]:
import pandas as pd

importing our dataset

In [81]:
pd.read_excel("Student_performance.xlsx")

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,NaN,54.0,69.0,78,77
9,718,female,21,Information_Technology,NaN,78.0,79,88
10,390,male,22,Computer_Science,45.0,NaN,79,85

giving the dataset  a shorter name so that it is easily called out

In [82]:
stud=pd.read_excel("Student_performance.xlsx")
stud

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,NaN,54.0,69.0,78,77
9,718,female,21,Information_Technology,NaN,78.0,79,88
10,390,male,22,Computer_Science,45.0,NaN,79,85

In [83]:
stud.describe(include='all')

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
count,11.000000,11,11.000000,10,10.000000,10.000000,11.000000,11.000000
unique,NaN,2,NaN,3,NaN,NaN,NaN,NaN
top,NaN,female,NaN,Computer_Science,NaN,NaN,NaN,NaN
freq,NaN,6,NaN,4,NaN,NaN,NaN,NaN
mean,496.545455,NaN,21.454545,NaN,63.200000,76.300000,70.090909,62.818182
std,278.903339,NaN,0.522233,NaN,24.220285,16.418486,18.030278,25.956957
min,123.000000,NaN,21.000000,NaN,25.000000,40.000000,38.000000,19.000000
25%,317.500000,NaN,21.000000,NaN,47.250000,70.000000,64.500000,42.000000
50%,415.000000,NaN,21.000000,NaN,67.500000,76.500000,78.000000,65.000000
75%,723.500000,NaN,22.000000,NaN,85.000000,86.000000,79.000000,86.500000
max,892.000000,NaN,22.000000,NaN,91.000000,98.000000,92.000000,93.000000

In [84]:
stud.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Access_no  11 non-null     int64
 1   gender     11 non-null     object
 2   age        11 non-null     int64
 3   course     10 non-null     object
 4   DSC3108    10 non-null     float64
 5   DSC3114    10 non-null     float64
 6   MTH3108    11 non-null     int64
 7   SYE3104    11 non-null     int64
dtypes: float64(2), int64(4), object(2)
memory usage: 836.0+ bytes

checking missin values in the dataset

In [85]:
stud.drop_duplicates()
stud=stud.drop_duplicates()

In [86]:
stud.isnull().sum()

Access_no    0
gender       0
age          0
course       1
DSC3108      1
DSC3114      1
MTH3108      0
SYE3104      0
dtype: int64

since DSC3108 is skewed we will use median to fill in the missing values and mode for course since it is categorical

In [87]:
stud["DSC3108"].fillna(value=stud['DSC3108'].median(),inplace=True)

In [88]:
stud["course"].fillna(value=stud['course'].mode()[0],inplace=True)

In [89]:
stud["DSC3114"].fillna(value=stud['DSC3114'].mean(),inplace=True)

In [90]:
stud.isnull().sum()

Access_no    0
gender       0
age          0
course       0
DSC3108      0
DSC3114      0
MTH3108      0
SYE3104      0
dtype: int64

## probability of a student studying information technology

In [91]:
course_total = stud['course'].count()
course_total

np.int64(11)

In [92]:
no_it = stud[stud['course'] == "Information_Technology"]['course'].count()
no_it

np.int64(3)

probability od student studying it

In [93]:
probability=no_it/course_total
print(f" the probability of student of stiudying information technology is {probability}")

 the probability of student of stiudying information technology is 0.2727272727272727

## probability of student studying computer science

In [94]:
gender_total=stud['gender'].count()
gender_total

np.int64(11)

i found the number of people who were female in the class

In [95]:
number_female=stud[stud['gender']=='female']['gender'].count()
number_female

np.int64(6)

i then found how many people were doing computer science

In [96]:
no_cs=stud[stud['course']=='Computer_Science']['course'].count()
no_cs

np.int64(5)

i then found how many of the 6 girls did computer science

In [99]:
filtered_data = (stud['course'] == 'Computer_Science') & (stud['gender'] == 'female')

In [100]:
female_cps_count=stud[filtered_data]['gender'].count()
female_cps_count

np.int64(2)

In [101]:
probability_cs_female=female_cps_count/no_cs
print(f"the probability of a person being a female and majoring computer science is {probability_cs_female}")

the probability of a person being a female and majoring computer science is 0.4

## probability of male student studying data science

In [102]:
gender_total=stud['gender'].count()
gender_total

np.int64(11)

In [103]:
number_male=stud[stud['gender']=='male']['gender'].count()
number_male

np.int64(5)

In [105]:
no_ds=stud[stud['course']=='Data_Science']['course'].count()
no_ds

np.int64(3)

In [106]:
filtered_data = (stud['course'] == 'Data_Science') & (stud['gender'] == 'male')

In [107]:
male_ds_count=stud[filtered_data]['gender'].count()
male_ds_count

np.int64(1)

In [108]:
probability_ds_male=male_ds_count/no_ds
print(f"the probability of a person being a female and majoring computer science is {probability_ds_male}")

the probability of a person being a female and majoring computer science is 0.3333333333333333